/*********************************************************
 * @auhtor: wupeng
 * @date: 2018-04-23
 * @version: v0.1
 * @desrciption：深入理解链表，参考网站：
 * https://blog.csdn.net/Lily_whl/article/details/71662133

 ********************************************************/
#include <stdio.h>  
#include <stdlib.h> 


 /******************************************************
  * @function：查找单链表初始化
  * @pararm: str 字符数组  
  * @pararm：len 字符串长度
  * @description:
*******************************************************/
 
 
 